## Production: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                   |
|--------|-----------------------------------------|
| add    | `aws_lambda_function_url.api`           |
|        | `aws_ssm_parameter.api_config`          |
|        | `module.api.aws_lambda_function.this`   |
| delete | `aws_ssm_parameter.github_token`        |
| update | `module.api.aws_iam_policy.policies[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_lambda_function_url.api will be created
  + resource "aws_lambda_function_url" "api" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "github-secret-scanning-api"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + url_id             = (known after apply)
    }

  # aws_ssm_parameter.api_config will be created
  + resource "aws_ssm_parameter" "api_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "github-secret-scanning-config"
      + tags           = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.github_token will be destroyed
  # (because aws_ssm_parameter.github_token is not in configuration)
  - resource "aws_ssm_parameter" "github_token" {
      - allowed_pattern = "" -> null
      - arn             = "arn:aws:ssm:ca-central-1:283582579564:parameter/github-secret-scanning-github-token" -> null
      - data_type       = "text" -> null
      - description     = "" -> null
      - id              = "github-secret-scanning-github-token" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "github-secret-scanning-github-token" -> null
      - tags            = {
          - "CostCentre" = "github-secret-scanning-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all        = {
          - "CostCentre" = "github-secret-scanning-production"
          - "Terraform"  = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value)
      - version         = 1 -> null
    }

  # module.api.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::283582579564:policy/github-secret-scanning-api-0"
        name      = "github-secret-scanning-api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:283582579564:parameter/github-secret-scanning-github-token"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "github-secret-scanning-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.api.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "github-secret-scanning-api"
      + id                             = (known after apply)
      + image_uri                      = "283582579564.dkr.ecr.ca-central-1.amazonaws.com/github-secret-scanning/api:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::283582579564:role/github-secret-scanning-api"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 120
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GITHUB_PUBLIC_KEYS_URL" = "https://api.github.com/meta/public_keys/secret_scanning"
              + "LOG_LEVEL"              = "WARNING"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + function_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
